app/controllers/cart_themes_controller.rb

  def index
    @cart_themes = CartTheme.all
---
SELECT "cart_themes".* FROM "cart_themes"