app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "status", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "csndasdkjan"], ["status", "jdnfssd"], ["image", "ndkjfnskj"], ["created_at", "2022-01-15 03:56:50.754549"], ["updated_at", "2022-01-15 03:56:50.754549"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save